IsParametric Property
 Identifies whether the family contains parametric relations between some of its elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017
 Syntax
  C#
public bool IsParametric { get; }
  Visual Basic
Public ReadOnly Property IsParametric As Boolean
	Get
  Visual C++
public:
property bool IsParametric {
	bool get ();
}
 Remarks
 A family is parametric if it contains parameter-driven relations between its elements, such as labeled dimensions or locked tangential joins.
 Parametric families containing large sketches may cause performance problems. Caution is therefore advised before adding any constraints to a yet non-parametric family that already contains large sketches. See  [!:DoesContainLargeSketches()]  .
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →